Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: Imagine that there are a lot of Widgets in a group that are on a scrollable Widget.
it_it: Si immagini che ci siano molti Widget in un gruppo che si trovano su un Widget scorrevole.

source: Imagine the background color is defined like this:
it_it: Si immagini che il colore di sfondo sia definito in questo modo:

source: Implement or extend this Specification in any **software or platform that provides UI creation, editing, or design capabilities similar to those in the LVGL UI Editor**.
it_it: Implementare o estendere questa Specifica in qualsiasi **software o piattaforma che fornisca funzionalità di creazione, modifica o progettazione di interfacce utente simili a quelle dell'LVGL UI Editor**.

source: Implementation Details
it_it: Dettagli di Implementazione

source: Implementation depends on multiple OS-specific functions.
it_it: L'implementazione dipende da più funzioni specifiche del sistema operativo.

source: Implementing the callbacks
it_it: Implementazione delle callback

source: Import the processed `trace.systrace` file into `Perfetto <https://ui.perfetto.dev>`_ and wait for it to be parsed.
it_it: Importare il file `trace.systrace` elaborato in `Perfetto <https://ui.perfetto.dev>`_ e attendere che venga analizzato.

source: Important Notes
it_it: Note Importanti

source: Important:
it_it: Importante:

source: Improving LVGL speed of execution
it_it: Migliorare la velocità di esecuzione di LVGL

source: Improving Performance
it_it: Miglioramento delle Prestazioni

source: In **Navigate** mode, an encoder's step is translated to :cpp:enumerator:`LV_KEY_NEXT` or :cpp:enumerator:`LV_KEY_PREV`.
it_it: In modalità **Navigate**, il passo di un encoder viene tradotto in :cpp:enumerator:`LV_KEY_NEXT` o :cpp:enumerator:`LV_KEY_PREV`.

source: In **SRCREV** Variable the commit hash of github repo is defined.
it_it: Nella variabile **SRCREV** viene definito l'hash di commit del repository GitHub.

source: In *Edit* mode, the encoder's step is usually used to modify the focused widget.
it_it: In modalità *Edit*, il passaggio dell'encoder viene solitamente utilizzato per modificare il focus del widget.

source: In 2021, Tasmota added full support of LVGL for ESP32 based devices.
it_it: Nel 2021, Tasmota ha aggiunto il supporto completo di LVGL per i dispositivi basati su ESP32.

source: In :cpp:enumerator:`LV_DISPLAY_RENDER_MODE_DIRECT`, the screen-sized draw buffer is divided by the tile count to determine the ideal tile sizes.
it_it: In :cpp:enumerator:`LV_DISPLAY_RENDER_MODE_DIRECT`, il buffer di disegno, delle dimensioni dello schermo, viene diviso per il numero di tile per determinarne le dimensioni ideali.

source: In :cpp:enumerator:`LV_DISPLAY_RENDER_MODE_FULL`, the maximum number of tiles is always created when the entire screen is refreshed.
it_it: In :cpp:enumerator:`LV_DISPLAY_RENDER_MODE_FULL`, il numero massimo di riquadri viene sempre creato quando l'intero schermo viene aggiornato.

source: In :cpp:enumerator:`LV_DISPLAY_RENDER_MODE_PARTIAL`, the partial buffer is divided into tiles.
it_it: In :cpp:enumerator:`LV_DISPLAY_RENDER_MODE_PARTIAL`, il buffer parziale è suddiviso in riquadri.

source: In :cpp:enumerator:`LV_EVENT_DRAW_TASK_ADDED` events, a major or minor line draw descriptor's members ``id1`` and ``id2`` will be the tick index and tick value, respectively.
it_it: Negli eventi :cpp:enumerator:`LV_EVENT_DRAW_TASK_ADDED`, i membri ``id1`` e ``id2`` di un descrittore di disegno di linea principale o secondario saranno rispettivamente l'indice della tacca e il suo valore.

source: In :cpp:enumerator:`LV_EVENT_DRAW_TASK_ADDED`, the draw descriptor of the ``draw_task`` can be accessed (using :cpp:type:`lv_draw_task_get_label_dsc()` and similar functions) and modified (to change color, text, font, etc.).
it_it: In :cpp:enumerator:`LV_EVENT_DRAW_TASK_ADDED`, è possibile accedere al descrittore di disegno di ``draw_task`` (utilizzando :cpp:type:`lv_draw_task_get_label_dsc()` e funzioni simili) e modificarlo (per cambiare colore, testo, font, ecc.).

source: In :ref:`flush_callback` the rendered images need to be copied to the given area of the display.
it_it: In :ref:`flush_callback`, le immagini renderizzate devono essere copiate nell'area specificata del display.

source: In Buildroot, a rootfs overlay (or root filesystem overlay) is a mechanism that allows you to add custom files, directories, and configurations directly into the root filesystem of the target image during the build process.
it_it: In Buildroot, un overlay rootfs (o overlay del filesystem di root) è un meccanismo che consente di aggiungere file, directory e configurazioni personalizzate direttamente nel filesystem di root dell'immagine target durante il processo di build.

source: In C a callback is just a function pointer.
it_it: In C, una callback è semplicemente un puntatore a funzione.

source: In HTML terms, think of it as a ``<div>``, a very versatile building block that, with some CSS and JS, can become almost anything.
it_it: In termini HTML, lo si pensi come un ``<div>``, un elemento costitutivo molto versatile che, con un po' di CSS e JS, può diventare praticamente qualsiasi cosa.

source: In LVGL fonts are collections of bitmaps and other information required to render the images of the individual letters (glyphs).
it_it: In LVGL, i font sono raccolte di bitmap e altre informazioni necessarie per riprodurre le immagini delle singole lettere (glifi).

source: In LVGL repository, there is a LICENSE.txt.
it_it: Nel repository LVGL, è presente un file LICENSE.txt.

source: In LVGL scrolling works very intuitively: if a Widget is outside its parent content area (the size without padding), the parent becomes scrollable and scrollbar(s) will appear.
it_it: In LVGL lo "scrolling" [scorrimento] funziona in modo molto intuitivo: se un Widget si trova al di fuori dell'area del contenuto principale (la dimensione senza padding), quest'ultima diventa scorrevole e vengono visualizzate le barre di scorrimento.

source: In LVGL v8.0 and newer, adding an event handler to the Keyboard does not remove the default event handler.
it_it: In LVGL v8.0 e versioni successive, l'aggiunta di un gestore eventi alla Keyboard non rimuove il gestore eventi di default.

source: In LVGL's UI Editor, when using fonts as data, it's also necessary to add the fonts to ``globals.xml`` with ``as_file=false``, so the Editor can generate the required C files and also perform validation when referencing data fonts.
it_it: Nell'editor dell'interfaccia utente di LVGL, quando si utilizzano i font come dati, è anche necessario aggiungerli a ``globals.xml`` con ``as_file=false``, in modo che l'editor possa generare i file C richiesti ed eseguire anche la validazione quando si fa riferimento ai font di dati.

source: In LVGL, an *lv_display_t* (not to be confused with a :ref:`Screen <screens>`) is a data type that represents a single display panel --- the hardware that displays LVGL-rendered pixels on your device.
it_it: In LVGL, un *lv_display_t* (da non confondere con :ref:`Screen <screens>`) è un tipo di dati che rappresenta un singolo pannello di visualizzazione, ovvero l'hardware che visualizza i pixel renderizzati in LVGL sul dispositivo.

source: In LVGL, the term "image" can refer to two things:
it_it: In LVGL, il termine "image" può riferirsi a due cose:

source: In MicroPython it's just ``Change code`` > ``Run``\ !
it_it: In MicroPython è semplicemente ``Modifica del codice`` > ``Run``\ !

source: In PlatformIO you can enable logging by editing the ``lv_conf.h`` file (or by adding defines in ``platformio.ini``).
it_it: In PlatformIO è possibile abilitare il logging modificando il file ``lv_conf.h`` (o aggiungendo i "define" in ``platformio.ini``).

source: In PlatformIO, you can place this file in the ``include/`` folder of your project (e.g., ``include/my_display.hpp``).
it_it: In PlatformIO, si può posizionare questo file nella cartella ``include/`` del proprio progetto (ad esempio, ``include/my_display.hpp``).

source: In PlatformIO, you’ll add both ``LVGL`` and ``LovyanGFX`` as dependencies in your ``platformio.ini``:
it_it: In PlatformIO, si aggiungeranno sia ``LVGL`` che ``LovyanGFX`` come dipendenze nel proprio file ``platformio.ini``:

source: In XML Files
it_it: Nei file XML

source: In XML files, both style sheets (:cpp:expr:`lv_style_t`) and local styles can be used.
it_it: Nei file XML, è possibile utilizzare sia fogli di stile (:cpp:expr:`lv_style_t`) che stili locali.

source: In XML files, fonts, images, styles, etc., are not used by pointer but by string names.
it_it: Nei file XML, font, immagini, stili, ecc. non vengono utilizzati tramite puntatori, ma tramite nomi di stringa.

source: In XML, fonts are considered external resources.
it_it: In XML, i font sono considerati risorse esterne.

source: In XML, images are considered external resources that need to be named in order to be referenced in XML files.
it_it: In XML, le immagini sono considerate risorse esterne che devono avere un nome per poter essere referenziate nei file XML.

source: In XML, they start with a ``<component>`` root element.
it_it: In XML, iniziano con un elemento radice ``<component>``.

source: In XML, they start with a ``<screen>`` root element.
it_it: In XML, iniziano con un elemento radice ``<screen>``.

source: In XML, they start with a ``<widget>`` root element.
it_it: In XML, iniziano con un elemento radice ``<widget>``.

source: In ``<component>`` and ``<widget>``, it is possible to define ``<preview>`` tags.
it_it: In ``<component>`` e ``<widget>``, è possibile definire i tag ``<preview>``.

source: In ``decoder_open()``, you should try to open the image source pointed by ``dsc->src``.
it_it: In ``decoder_open()``, si deve provare ad aprire la sorgente dell'immagine puntata da ``dsc->src``.

source: In ``lv_conf.h`` enable ``LV_USE_FS_...`` (by setting its value to ``1``) and assign an upper cased letter to ``LV_FS_..._DRIVER_LETTER`` (e.g. ``'S'``).
it_it: In ``lv_conf.h`` abilitare ``LV_USE_FS_...`` (impostandone il valore a ``1``) e assegnare una lettera maiuscola a ``LV_FS_..._DRIVER_LETTER`` (ad esempio ``'S'``).

source: In ``lv_conf.h``, go to the Log settings section and enable the log module:
it_it: In ``lv_conf.h``, si va alla sezione "Log settings" e si abilita il modulo log:

source: In ``lv_libpng.c``, see the following functions as examples to follow.
it_it: In ``lv_libpng.c``, si vedono le seguenti funzioni come esempi da seguire.

source: In ``read_cb``, you can report the buffered data instead of directly reading the input device.
it_it: In ``read_cb``, è possibile segnalare i dati memorizzati nel buffer invece di leggere direttamente il dispositivo di input.

source: In a C file add :cpp:expr:`LV_FONT_DECLARE(font_name)` to declare the font
it_it: In un file C si aggiunge :cpp:expr:`LV_FONT_DECLARE(font_name)` per dichiarare il font

source: In addition to "normal" styles, Widgets can also store local styles.
it_it: Oltre agli stili "normali", i Widget possono anche memorizzare stili locali.

source: In addition to :cpp:func:`lv_display_get_inactive_time` you can check :cpp:func:`lv_anim_count_running` to see if all animations have finished.
it_it: Oltre a :cpp:func:`lv_display_get_inactive_time` si può controllare :cpp:func:`lv_anim_count_running` per verificare se tutte le animazioni sono terminate.

source: In addition to binding C modules, the precompiler compiles Python scripts to bytecode in the PC, reducing the size of the script and increasing its speed.
it_it: Oltre ad associare i moduli C, il precompilatore compila gli script Python in bytecode nel PC, riducendo le dimensioni dello script e aumentandone la velocità.

source: In addition to production use, the driver is also useful for development on linux desktop environments, offering a convenient way to simulate and validate your LVGL applications without dedicated hardware.
it_it: Oltre all'uso in produzione, il driver è utile anche per lo sviluppo su ambienti desktop Linux, offrendo un modo pratico per simulare e convalidare le applicazioni LVGL senza hardware dedicato.

source: In addition to standard encoder behavior, you can also utilize its logic to navigate (focus) and edit widgets using buttons.
it_it: Oltre al comportamento standard dell'encoder, è possibile utilizzare la sua logica anche per navigare (focus) e modificare i widget tramite i pulsanti.

source: In addition to the ASCII range all the :ref:`predefined symbols <font_symbols>` are added to the built-in fonts from the `FontAwesome <https://fontawesome.com/>`__ font.
it_it: Oltre al range ASCII, tutti i :ref:`simboli predefiniti <font_symbols>` vengono aggiunti ai font integrati dal font `FontAwesome <https://fontawesome.com/>`__.

source: In addition to the component CMakeLists file, you'll also need to tell your project level CMakeLists in your IDF project to require rlottie:
it_it: Oltre al file CMakeLists del componente, si dovrà anche specificare al CMakeLists al livello di progetto nel proprio progetto IDF di richiedere rlottie:

source: In addition, :cpp:enumerator:`LV_SPAN_MODE_FIXED` and :cpp:enumerator:`LV_SPAN_MODE_BREAK` modes support percentage units as well (e.g. ``lv_pct(10)``).
it_it: Inoltre, le modalità :cpp:enumerator:`LV_SPAN_MODE_FIXED` e :cpp:enumerator:`LV_SPAN_MODE_BREAK` supportano anche le unità percentuali (ad esempio ``lv_pct(10)``).

source: In addition, LVGL also provides its own inbuilt display drivers that can be used directly in your project.
it_it: Inoltre, LVGL fornisce anche i propri driver display integrati utilizzabili direttamente nel proprio progetto.

source: In addition, ``id`` can be negative to index from the end of the Spangroup where ``-1`` is the youngest child, ``-2`` is second youngest, etc.
it_it: Inoltre, ``id`` può essere negativo per indicizzare dalla fine dello Spangroup, dove ``-1`` è l'elemento figlio più giovane, ``-2`` è il secondo più giovane, ecc.

source: In addition, because of the integrated power supply circuit necessary to drive liquid crystal; it is possible to make a display system with fewest components.
it_it: Inoltre, grazie al circuito di alimentazione integrato necessario per pilotare i cristalli liquidi, è possibile realizzare un sistema di visualizzazione con un numero inferiore di componenti.

source: In addition, because of the integrated power supply circuit necessary to drive liquid crystal; it is possible to make a display system with the fewest components.
it_it: Inoltre, grazie al circuito di alimentazione integrato necessario per pilotare i cristalli liquidi, è possibile realizzare un sistema di visualizzazione con il minor numero di componenti.

source: In addition, because of the integrated power supply circuits necessary to drive liquid crystal, it is possible to make a display system with fewer components.
it_it: Inoltre, grazie ai circuiti di alimentazione integrati necessari per pilotare i cristalli liquidi, è possibile realizzare un sistema di visualizzazione con un numero inferiore di componenti.

source: In all event types, the ``trigger`` attribute defines what kind of user action should trigger the event.
it_it: In tutti i tipi di evento, l'attributo ``trigger`` definisce il tipo di azione dell'utente che deve attivare l'evento.

source: In an :cpp:enumerator:`LV_EVENT_DRAW_TASK_ADDED` event, the elements of the base draw descriptor are very useful to identify the Draw Task.
it_it: In un evento :cpp:enumerator:`LV_EVENT_DRAW_TASK_ADDED`, gli elementi del descrittore di disegno di base sono molto utili per identificare il Task di Disegno.

source: In an OS environment, you can use it together with the **delay** or **sleep** provided by OS to release CPU whenever possible:
it_it: In un ambiente di sistema operativo, è possibile utilizzarlo insieme a **delay** o a **sleep** fornito dal sistema operativo per rilasciare la CPU quando possibile:

source: In both cases, it's required to log in with a GitHub account to avoid API rate limits and access private repositories if needed.
it_it: In entrambi i casi, è necessario accedere con un account GitHub per evitare i limiti di velocità delle API e accedere ai repository privati, se necessario.

source: In both cases, the "assembled" value is a 32-bit value:
it_it: In entrambi i casi, il valore "assemblato" è un valore a 32 bit:

source: In both cases, you can bit-wise OR multiple state values.
it_it: In entrambi i casi, è possibile eseguire l'operazione OR bit per bit su più valori di stato.

source: In both scenarios the result will be reflected on less time to flush data to the display, resulting in higher frame-rates.
it_it: In entrambi gli scenari, il risultato si tradurrà in un tempo inferiore per il trasferimento dei dati sul display, con conseguente aumento del frame rate.

source: In case of RGB565 color format it might be required to swap the 2 bytes because the SPI, I2C or 8 bit parallel port periphery sends them in the wrong order.
it_it: Nel caso del formato colore RGB565, potrebbe essere necessario scambiare i 2 byte perché la periferica SPI, I2C o la porta parallela a 8 bit li invia nell'ordine sbagliato.

source: In case of a DMA transfer this call is usually made in an interrupt service routine (ISR) that fires when the DMA transfer is complete.
it_it: In caso di trasferimento DMA, questa chiamata viene solitamente effettuata in una routine di servizio di interrupt (ISR) che si attiva al termine del trasferimento.

source: In case of a widget the more powerful :ref:`elements with get access type <xml_api_element_get>` can be used.
it_it: Nel caso di un widget, è possibile utilizzare gli :ref:`elementi col tipo di accesso get <xml_api_element_get>`, più potenti.

source: In case of any problems or questions open an issue in the corresponding repository.
it_it: In caso di problemi o domande, aprire una "issue" nel repository corrispondente.

source: In case you chose any of the other supported boards you can flash to the device with:
it_it: Se è stata scelta una qualsiasi delle altre schede supportate, si può flashare sul dispositivo con:

source: In case you do not want to use esp_lvgl_port, you can add `LVGL component <https://components.espressif.com/component/lvgl/lvgl>`__ into your project with following command:
it_it: Se non si desidera utilizzare esp_lvgl_port, è possibile aggiungere `LVGL component <https://components.espressif.com/component/lvgl/lvgl>`__ al progetto con il seguente comando:

source: In cases when the PSRAM is enabled and the PPA is used, it is common to see frame-rate degradation followed by a message on the log that reports the display buffer will underrun.
it_it: Nei casi in cui la PSRAM è abilitata e viene utilizzato il PPA, è comune osservare un degrado del frame rate seguito da un messaggio nel log che segnala che il buffer di visualizzazione sarà "underrun".

source: In comments use back-quotes (\`...\`) when referring to a code element, such as a variable, type, or struct name: ``/* Update value of `x_act` */``
it_it: Nei commenti, utilizzare le virgolette inverse (\`...\`) quando si fa riferimento a un elemento del codice, come una variabile, un tipo o il nome di una struttura: ``/* Update value of `x_act` */``

source: In documentation of widgets you will see sentences like "XY Widget uses the typical background style properties".
it_it: Nella documentazione dei widget si troveranno frasi come "Il Widget XY utilizza le proprietà tipiche del background".

source: In drawing-event callback functions the rendering sequence has already begun, and during this period, making changes to any Widget's attributes, styles, or creating/deleting widgets is forbidden.
it_it: Nelle funzioni di callback degli eventi di disegno, la sequenza di rendering è già iniziata e, durante questo periodo, è vietato apportare modifiche agli attributi o agli stili di qualsiasi widget o creare/eliminare widget.

source: In each draw descriptor there is a generic "base descriptor" with :cpp:type:`lv_draw_dsc_base_t` type and with ``base`` in its name.
it_it: In ogni descrittore di disegno è presente un "descrittore di base" generico con tipo :cpp:type:`lv_draw_dsc_base_t` e con ``base`` nel nome.

source: In either case first you need to enable :c:macro:`LV_USE_RLOTTIE` in ``lv_conf.h`` by setting its value to ``1``.
it_it: In entrambi i casi, si deve prima abilitare :c:macro:`LV_USE_RLOTTIE` in ``lv_conf.h`` impostandone il valore a ``1``.

source: In enums and defines use only upper case letters (e.g. *MAX_LINE_NUM*)
it_it: Negli enum e nelle definizioni utilizzare solo lettere maiuscole (ad esempio *MAX_LINE_NUM*)

source: In fact, GPU hardware does not actually support shadow rendering.
it_it: In effetti, l'hardware GPU non supporta effettivamente il rendering delle ombreggiature.

source: In fact, those carrier boards are compatible with all 34-pin Riverdi MIPI-DSI displays.
it_it: Infatti, queste schede carrier sono compatibili con tutti i display Riverdi MIPI-DSI a 34 pin.

source: In full and direct modes, the buffer size should be large enough for the whole screen, meaning ``(horizontal_resolution x vertical_resolution / 8) + 8`` bytes.
it_it: In modalità completo e diretto, la dimensione del buffer dovrebbe essere sufficientemente grande per l'intero schermo, ovvero ``(horizontal_resolution x vertical_resolution / 8) + 8`` byte.

source: In function arguments use ``type name[]`` declaration for array parameters instead of :cpp:expr:`type * name`
it_it: Negli argomenti delle funzioni, utilizzare la dichiarazione ``type name[]`` per i parametri dell'array invece di :cpp:expr:`type * name`

source: In general, a recipe contains information about a single piece of software.
it_it: In generale, una ricetta contiene informazioni su un singolo software.

source: In general, the DMA2D draw unit can handle fills and images that use standard color formats, no gradient, no transforms, and no radius.
it_it: In generale, l'unità di disegno DMA2D può gestire riempimenti e immagini che utilizzano formati di colore standard, senza gradiente, senza trasformazioni e senza raggio.

source: In general, using subjects and observers is a way to connect various parts of the UI and make them dynamically react to application data changes—or allow the application to react to UI changes.
it_it: In generale, l'utilizzo di *soggetti* e *osservatori* è un modo per collegare varie parti dell'interfaccia utente e farle reagire dinamicamente alle modifiche dei dati dell'applicazione, oppure consentire all'applicazione di reagire alle modifiche dell'interfaccia utente.

source: In general:
it_it: In generale:

source: In light of that, permanent screens only need to be **loaded** by ``<screen_load_event screen="my_permanent_screen"/>`` and non-permanent screens need to be **created** by ``<screen_create_event screen="my_non_permanent_screen"/>``.
it_it: Alla luce di ciò, le schermate permanenti devono essere **caricate** solo da ``<screen_load_event screen="my_permanent_screen"/>`` e quelle non-permanenti devono essere **create** da ``<screen_create_event screen="my_non_permanent_screen"/>``.

source: In more complex cases—when a binding requires multiple parameters—the binding can be added as a child element of a widget.
it_it: Nei casi più complessi, quando un binding richiede più parametri, il binding può essere aggiunto come elemento figlio di un widget.

source: In most cases a layer is not created, but an existing layer is used to draw there.
it_it: Nella maggior parte dei casi non viene creato un layer, ma ne viene utilizzato uno esistente per disegnarlo.

source: In most cases this means calling the ``lv_draw_rect/label/etc`` functions.
it_it: Nella maggior parte dei casi, ciò significa chiamare le funzioni ``lv_draw_rect/label/etc``.
